import React from 'react';

const Info = () => {
    return (
        <div style={{
            textAlign: "left",
            margin: "10px 5px"
        }}>
            <h2>Հեմմինգի կոդ</h2>
            <p>
                Այս հավելվածում կդիտարկենք Հեմինգի կոդը։ Այն ընդունակ է գտնել և վերականգնել մեկ բիթի սխալ։Սխալներն
                ուղղելու համար լեզվում օգտագործում են ավելցուկային ինֆորմացիա, որը հնարավորություն է տալիս հայտնաբերել և
                ուղղել առաջացած սխալները: Օպտիմալ կապերը ավելցուկային ինֆորմացիա չունեն, այդ իսկ պատճառով դրանք
                պիտանի չեն սխալներ առաջացնող ուղիներով հաղորդագրություններ ուղարկելու համար:

            </p>
        </div>
    );
};

export default Info;